//다음은 Python의 리스트 객체에 속한 메소드들에 대한 설명이다. 각 괄호 (1~3)에 해당하는 메소드의 이름을 <보기>에서 찾아 쓰시오.

//Python에서는 여러 요소들을 한 개의 이름으로 처리할 때 리스트를 사용하며, 각 요소에는 정수, 실수, 문자열 등
//다양한 자료형을 섞어 저장할 수 있다. 또 리스트는 메소드를 활용하여 요소를 추가 및 삭제할 수 있을 뿐만 아니라
//정렬하거나 다른 리스트와 병합하는 등의 다양한 작업을 손쉽게 수행할 수 있다.
//(1) : 기존 리스트에 인수의 요소들을 추가하여 확장하는 메소드로, 여러 값을 한 번에 추가할 수 있다.
//(2): 리스트에서 맨 마지막 또는 인수의 값에 해당하는 위치의 요소를 삭제한 후 반환한다.
//(3): 리스트에 저장된 각 요소들의 순서를 역순으로 뒤집어 저장하는 메소드이다.

//<보기>
//(ㄱ) pop()
//(ㄴ) push()
//(ㄷ) reverse()
//(ㄹ) index()
//(ㅁ) write()
//(ㅂ) sort()
//(ㅅ) extend()
//(ㅇ) copy()

//답
//1: extend()
//2: pop()
//3: reverse()
